---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal
source: html/5ab8e067-f7b3-6a27-0491-e696af6b765e.htm
---
# VertexStreamPositionNormal Properties

Specifies whether the .NET object represents a valid Revit entity.